
### :robot: Terraform Report
---
##### Plan: `12` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.gcp-tf-base.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "gpu-cloud-init-project-network"
      + project                         = "gpu-cloud-init-project"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.gcp-tf-base.google_compute_shared_vpc_host_project.host will be created
  + resource "google_compute_shared_vpc_host_project" "host" {
      + id      = (known after apply)
      + project = "gpu-cloud-init-project"
    }

  # module.gcp-tf-base.google_compute_subnetwork.default_subnet will be created
  + resource "google_compute_subnetwork" "default_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "gpu-cloud-init-project-subnet"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "europe-west4"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.gcp-tf-base.google_kms_crypto_key.key will be created
  + resource "google_kms_crypto_key" "key" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = "projects/gpu-cloud-init-project/locations/europe-west4/keyRings/mykeyring"
      + name                       = (known after apply)
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "100000s"
    }

  # module.gcp-tf-base.google_kms_key_ring_iam_policy.key_ring_policy will be created
  + resource "google_kms_key_ring_iam_policy" "key_ring_policy" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + key_ring_id = "projects/gpu-cloud-init-project/locations/europe-west4/keyRings/mykeyring"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "group:admin-bot-group@deserialize.me",
                        ]
                      + role    = "roles/editor"
                    },
                ]
            }
        )
    }

  # module.gcp-tf-base.google_service_account_key.mykey will be created
  + resource "google_service_account_key" "mykey" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/gpu-cloud-init-project/serviceAccounts/myserviceaccount@gpu-cloud-init-project.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.gcp-tf-base.random_string.random-key-name will be created
  + resource "random_string" "random-key-name" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.gcp-tf-vm.google_compute_address.static_ip will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "static-address"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.gcp-tf-vm.google_compute_firewall.allow-ssh will be created
  + resource "google_compute_firewall" "allow-ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ssh"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "ssh",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.gcp-tf-vm.google_compute_firewall.rules will be created
  + resource "google_compute_firewall" "rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates firewall rule targeting tagged instances"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "web-ingress-rules"
      + network            = "default"
      + priority           = 1000
      + project            = "gpu-cloud-init-project"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "web",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8080",
              + "1000-2000",
            ]
          + protocol = "tcp"
        }
    }

  # module.gcp-tf-vm.google_compute_instance.compute_instance will be created
  + resource "google_compute_instance" "compute_instance" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = [
          + {
              + count = 1
              + type  = "nvidia-tesla-p100"
            },
        ]
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-8"
      + metadata             = {
          + "user-data" = <<-EOT
                #cloud-config
                hostname: virtual-bradley
                fqdn: virtual-bradley
                disable_root: false
                network:
                  config: disabled
                users:
                  - name: max
                    groups: users, admin, docker, sudo
                    sudo: ALL=(ALL) NOPASSWD:ALL
                    shell: /bin/bash
                    lock_passwd: false
                    passwd: "$6$rounds=4096$saltsaltlettuce$Lp/FV.2oOgew7GbM6Nr8KMGMBn7iFM0x9ZwLqtx9Y4QJmKvfcnS.2zx4MKmymCPQGpHS7gqYOiqWjvdCIV2uN."
                    ssh_import_id:
                      - gh:cloudymax
                package_update: true
                package_upgrade: true
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = (known after apply)
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "ssh",
          + "web",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "europe-west4-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels = (known after apply)
              + size   = 128
              + type   = "pd-ssd"
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = false
          + instance_termination_action = "STOP"
          + on_host_maintenance         = (known after apply)
          + preemptible                 = true
          + provisioning_model          = "SPOT"
        }

      + service_account {
          + email  = "myserviceaccount@gpu-cloud-init-project.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.gcp-tf-vm.random_pet.vm_name will be created
  + resource "random_pet" "vm_name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#4818981379`](https://github.com/cloudymax/gcp-tf-starter/actions/runs/4818981379) - commit 79120edfff04bcaa38789d9c65b04b14290ce5aa
